# MySql - conexion

In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
with open('credentials.txt','r') as fr:
    credentials = fr.readline()
credentials

'Admin'

In [3]:
engine = create_engine(f"mysql+pymysql://root:{credentials}@localhost/sakila")

In [4]:
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [5]:
data = pd.read_sql_query(
    "SELECT * FROM sakila.actor",
    engine)
data.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33